Friends | List of all members
ACAPI::MEP::PipeAngleSet Class Referencefinal
MEP Element Manager
The PipeAngleSet contains angles that are used in PipeElbowPreferenceTable and PipeBranchPreferenceTable. More...
#include <MEPPipeAngleSet.hpp>
 Inheritance diagram for ACAPI::MEP::PipeAngleSet:
 Friends
Result< PipeAngleSet >  | GetPipeAngleSet ()
 Additional Inherited Members
 Public Member Functions inherited from ACAPI::MEP::AngleSetBase
bool  | Exists () const
Result< void >  | IsEditable () const
Checks whether the table is editable.
GS::UniString  | GetName () const
uint32_t  | GetSize () const
Result< double >  | GetAngle (uint32_t index) const
Result< bool >  | IsAngleDefined (uint32_t index) const
Checks whether an entry from the angleSet is defined. A angle is defined if at least one preferenceTable has values associated to it.
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions inherited from ACAPI::MEP::AngleSetBase
AngleSetBase (std::shared_ptr< Impl::IAngleSetBaseImpl > impl)
Constructs a AngleSetBase with the given base implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The PipeAngleSet contains angles that are used in PipeElbowPreferenceTable and PipeBranchPreferenceTable.
Since
Archicad 29
The container is already initialized and you can access it by calling GetPipeAngleSet.
Example code snippet from Test / New MEP
Take a look at AngleSetBase
Friends And Related Symbol Documentation
◆ GetPipeAngleSet
 Result< PipeAngleSet > GetPipeAngleSet  |  ( |   | )
friend
Returns
If able, returns the PipeAngleSet from the project.